1) Фреймворк - это типо каркаса или фундамента,
он облегчает твою работу, по сути делает большую часть за тебя,
тебе просто надо где-то что-то настроить. Фреймворки используются
для разный целей, например, есть фреймворк Django,
он используются для создания сайтов, а именно для back-end'а

2) SQL(structured query language) - это язык структурированных запросов с помощью него мы можем управлять базами данных,
создавать их, удалать, редактировать, добавлять что-то и т.д,
еще SQL называют СУБД(система управления базами данных)
Примеры SQL кода:
CREATE DATEBASE Categoty;
\c Category
CREATE TABLE Candeis(id, name);
INSERT INTO Candies(id, name) values(1, Chocolate);
SELECT * FROM Candies;

3) ORM(Object-Relational Mapping) переводится как объектно-реляционное отображение, проще говоря, это технология, которая
позволяет упрявлять базами данных с помощью языка
прогроммирования, например, с помощью python'a

4) Есть 4 принципа ООП:

    1.Абстракция
    2.Инкапсуляция
    3.Наследование
    4.Полиморфизм

Абстракция - это придание объекту характеристик, которые отличают его от всех объектов

Инкапсуляция - это сокрытие обьектов класса, делая их
недоступными

Наследование - это наследование методов родительского класса

Полиморфизм - это возможность объектов с одинаковой спецификацией
иметь различную реализацию

5) Агрегация - это отношение has-a "содержиться в", когда в классе есть какие-либо методы:
метод __init__ , get_number и т.д

Ассоциация - это отношение use-a "использует", когда класс ссылаетса на другой класс и
использует его методы